cf_billing/Documents/бестСуточнаяВедомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестСуточнаяВедомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестИтоговыеЗначенияПараметровСуточнойВедомости</xr:Item>
				<xr:Item>AccumulationRegister.бестОбъемНачисленийНП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНастроекЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестШаблоныЗагрузокСуточнойВедомости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыИзмерителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестВидыПараметровИзмерителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВремя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BНP</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BOC</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестПараметрыИзмерителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПараметрыИзмерителей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестВидыПараметровИзмерителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасположениеИзмерителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргРасположениеИзмерителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТемпературы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыТемператур</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Измеритель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестСуточнаяВедомость/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область События_Формы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ПриборУчета) Тогда
		ЗаполнитьКолонкиТаблицыИзРегистра(); 		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестСуточнаяВедомость(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ)
	ОчиститьТЧ();
	
	ТаблицаДляСохранения 	= ПараметрыИзмерителя.Выгрузить();
	Если ТаблицаДляСохранения.Количество() = 0 Тогда 		
		Возврат;
	КонецЕсли;
	
	Колонки 			= ТаблицаДляСохранения.Колонки;	
	МодульСпр 			= Справочники.бестВидыПараметровИзмерителей;
	МодульДок 			= Документы.бестСуточнаяВедомость;
	ПустаяСсылкаСпр 	= МодульСпр.ПустаяСсылка();
	
	СтатическиеКолонки 	= МодульДок.ПолучитьСтатическиеКолонки();	
	
	Для Каждого Колонка из Колонки Цикл
		Если не СтатическиеКолонки.Получить(Колонка.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;		
		
		ВидПараметра = МодульДок.ПолучитьЭлементСправочникаПоКолонке(Колонка.Имя,ПустаяСсылкаСпр,МодульСпр);
		
		Если ВидПараметра = ПустаяСсылкаСпр Тогда
			Отказ = Истина;
			Прервать;
		КонецЕсли;	
		
		Для Каждого Стр из ТаблицаДляСохранения Цикл
			НоваяСтрока = Объект.ПараметрыИзмерителя.Добавить();
		
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
			НоваяСтрока.ВидПараметра 	= ВидПараметра;
			НоваяСтрока.Значение 		= Стр[Колонка.Имя];		 			
		КонецЦикла;
		
	КонецЦикла;
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестСуточнаяВедомость(ЭтотОбъект, Объект.Ссылка);

КонецПроцедуры

Процедура УстановитьУсловноеОформление(ЭлементТЗ)
	
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
    ПолеОформления 					= ЭлементОформления.Поля.Элементы.Добавить();	
    ПолеОформления.Поле 			= Новый ПолеКомпоновкиДанных(ЭлементТЗ.Имя); 
    ПолеОформления.Использование	= Истина;
	
    ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПараметрыИзмерителя.ДатаВремя");   
    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;    
    ЭлементОтбора.ПравоеЗначение = Дата(1,1,1,0,0,0);
    ЭлементОтбора.Использование  = Истина;
	
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт("Arial",11,Истина,,,,));

КонецПроцедуры

#КонецОбласти

#Область ЗАГРУЗКА_ИЗ_ФАЙЛА 

#Область EXEL

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Ошибки = ВернутьОшибки();
	Если Ошибки.Количество() = 0 Тогда
		
		Модифицированность = Истина;
		
		Диалог 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок 		= "Выберите excel - файл";		
		Диалог.Фильтр 			= "Таблицы (*.xls,*.xlsx)|*.xls;*.xlsx;|Microsoft Excel 97/2000/XP/2003 (*.xls)|*.xls|Microsoft Excel 2007/2010 (*.xlsx)|*.xlsx";
		
		Если Диалог.Выбрать() Тогда
			ПолноеИмяФайла 	= Диалог.ПолноеИмяФайла;
			ДлинаКаталога	= СтрДлина(Диалог.каталог);
			ПолнаяДлина		= СтрДлина(ПолноеИмяФайла);
			СокрИмяФайла	= Прав(ПолноеИмяФайла,ПолнаяДлина - ДлинаКаталога);
			
			Удалось 				= Ложь;
			ДанныеИзФайлаСКлиента 	= ПопробоватьПолучитьДанныеНаКлиенте(ПолноеИмяФайла,Удалось);
			
			Если Удалось Тогда
				ЗагрузитьИзФайлаНаСервере("","",ДанныеИзФайлаСКлиента);
			Иначе 				
				Файл 			= Новый ДвоичныеДанные(ПолноеИмяФайла);
				Адрес 			= ПоместитьВоВременноеХранилище(Файл, ЭтаФорма.УникальныйИдентификатор);
				
				ЗагрузитьИзФайлаНаСервере(Адрес,СокрИмяФайла);	
			КонецЕсли;
		КонецЕсли;		
		
	Иначе
		Для Каждого ТекСтрока из Ошибки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекСтрока.ТекстОшибки,,ТекСтрока.Поле,ТекСтрока.Объект);
		КонецЦикла; 		
	КонецЕсли;
	
	ЗаполнитьТаблицуДаннымиТЧ();
КонецПроцедуры

#Если НЕ МобильныйКлиент Тогда

&НаКлиенте
Функция ПопробоватьПолучитьДанныеНаКлиенте(ПутьКФайлу,Удалось)
	Таблица = новый Массив;
	
	// Попытка открытия файла Excel
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ПутьКФайлу);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='При открытии файла произошла ошибка! Операция прервана!'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр(ОписаниеОшибки()));
		Возврат Таблица;
	КонецПопытки;
	
	// Попытка выбрать первый лист
	Попытка 
		Excel.Sheets(1).Select();    
	Исключение
		// Закрытие файла в том случае, если первый лист не найден
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Первый лист не найден!'"));
		Возврат Таблица;
	КонецПопытки;
	
	// Получим количество строк и колонок.
	// В разных версиях Excel получаются по-разному, поэтому сначала определим версию Excel
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок 	= Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок 	= Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;
	Конецесли;
	
	//Сч = 1;	
	//Соответствие = Новый Соответствие;
	//Пока ЗначениеЗаполнено(Excel.Cells(1, Сч).Text) Цикл
	//	//ИмяКолонки 		= Excel.Cells(1, Сч).Text;
	//	//ИмяБезПробелов 	= СтрЗаменить(ИмяКолонки," ","");
	//	Соответствие.Вставить(Сч,"Колонка" + Сч);		
	//	Сч = Сч + 1;
	//КонецЦикла;
	
	ДанныеШаблона 	= ПолучитьДанныеШаблона();
	НачальнаяСтрока = ?(ДанныеШаблона.НачальнаяСтрока > 0 ,ДанныеШаблона.НачальнаяСтрока,2); 
	ФайлСтрок 		= ?(ДанныеШаблона.КонечнаяСтрока > 0  ,ДанныеШаблона.КонечнаяСтрока ,ФайлСтрок);
	
	Для НС = НачальнаяСтрока по ФайлСтрок Цикл 	
		
		СтруктураДанных = Новый Структура;
		
		Сч = 1;	
		Пока Сч <= ФайлКолонок Цикл
			// заполняем строку значениями
			ТекущееЗначение 		= Excel.Cells(НС, Сч).Text;
			СтруктураДанных.Вставить("Колонка" + Сч,ТекущееЗначение); 
			Сч = Сч + 1;
		КонецЦикла;
		
		//Для Каждого Колонка Из Соответствие Цикл
		//	// заполняем строку значениями
		//	ТекущееЗначение 		= Excel.Cells(НС, Колонка.Ключ).Text;
		//	СтруктураДанных.Вставить(Колонка.Значение,ТекущееЗначение); 			
		//КонецЦикла;
		
		Таблица.Добавить(СтруктураДанных);

	КонецЦикла;
	
	Excel.DisplayAlerts = 0; 
	Excel.Quit();
	Excel.DisplayAlerts = 1;
	
	Удалось = Истина;
	
	Возврат Таблица;
КонецФункции

#КонецЕсли

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(ФайлВХранилище, СокрИмяФайла, ДанныеИзФайлаСКлиента = Неопределено)
	Объект.ПараметрыИзмерителя.Очистить();
	
	Если ДанныеИзФайлаСКлиента = Неопределено Тогда
		ДвоичныеДанные 	= ПолучитьИзВременногоХранилища(ФайлВХранилище);	
		ПутьКФайлу 		= КаталогВременныхФайлов() + СокрИмяФайла;
		ДвоичныеДанные.Записать(ПутьКФайлу);	
		
		Документы.бестСуточнаяВедомость.ЗагрузитьДанныеИзФайла(ПутьКФайлу, Объект.ШаблонНастроекЗагрузки, Объект.ПараметрыИзмерителя);
	Иначе
		Документы.бестСуточнаяВедомость.ЗаполнитьДанныеИзФайлаВТЧ(ДанныеИзФайлаСКлиента, Объект.ШаблонНастроекЗагрузки, Объект.ПараметрыИзмерителя);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#Область TXT

&НаКлиенте
Процедура ФорматTXT(Команда)
	Модифицированность = Истина;
	
	Диалог 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок 		= "Выберите TXT - файл";		
	Диалог.Фильтр 			= "Текстовый файл (*.txt)|*.txt|";
	
	Если Диалог.Выбрать() Тогда
		ПолноеИмяФайла 	= Диалог.ПолноеИмяФайла;
		ДлинаКаталога	= СтрДлина(Диалог.каталог);
		ПолнаяДлина		= СтрДлина(ПолноеИмяФайла);
		СокрИмяФайла	= Прав(ПолноеИмяФайла,ПолнаяДлина - ДлинаКаталога);
		
		
		Файл 			= Новый ДвоичныеДанные(ПолноеИмяФайла);
		Адрес 			= ПоместитьВоВременноеХранилище(Файл, ЭтаФорма.УникальныйИдентификатор);
		
		ФорматTXTНаСервере(Адрес,СокрИмяФайла);
		
		Если Объект.ПараметрыИзмерителя.Количество() > 0 Тогда
			ЗаполнитьТаблицуДаннымиТЧ();
		КонецЕсли;
		
	КонецЕсли; 	
	
КонецПроцедуры  

&НаСервере
Процедура ФорматTXTНаСервере(ФайлВХранилище, СокрИмяФайла)
	Объект.ПараметрыИзмерителя.Очистить();
	
	ДвоичныеДанные 	= ПолучитьИзВременногоХранилища(ФайлВХранилище);	
	ПутьКФайлу 		= КаталогВременныхФайлов() + СокрИмяФайла;
	ДвоичныеДанные.Записать(ПутьКФайлу);	
	
	Документы.бестСуточнаяВедомость.ЗагрузитьДанныеИзФайлаTXT(ПутьКФайлу, Объект.ШаблонНастроекЗагрузки, Объект.ПараметрыИзмерителя);
КонецПроцедуры
	
#КонецОбласти

//============================================
&НаКлиенте
Функция ВернутьОшибки()
	
	МассивОшибок = Новый Массив;
	Если не ЗначениеЗаполнено(Объект.ШаблонНастроекЗагрузки) Тогда
		МассивОшибок.Добавить(Новый Структура("ТекстОшибки,Поле,Объект",НСтр("ru = 'Выберите шаблон настроек загрузки'"),"ШаблонНастроекЗагрузки","Объект"));
	КонецЕсли;
	Если не ЗначениеЗаполнено(Объект.ПриборУчета) Тогда
		МассивОшибок.Добавить(Новый Структура("ТекстОшибки,Поле,Объект",НСтр("ru = 'Выберите прибор учета'"),"ПриборУчета","Объект"));
	КонецЕсли;
	
	Возврат МассивОшибок;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеШаблона()	
	Возврат Новый Структура("НачальнаяСтрока,КонечнаяСтрока",Объект.ШаблонНастроекЗагрузки.НачальнаяСтрока,Объект.ШаблонНастроекЗагрузки.КонечнаяСтрока);
КонецФункции

#КонецОбласти

#Область События_При_Изменении 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер(); 		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриборУчетаПриИзменении(Элемент)
	ОчиститьТЧ();
	ЗаполнитьКолонкиТаблицыИзРегистра();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОчиститьТЧ();
	ЗаполнитьКолонкиТаблицыИзРегистра();
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район,"Организация");
	ЗаполнитьПериодНачисленияСервер();
	ОчиститьТЧ();
	ЗаполнитьКолонкиТаблицыИзРегистра();
КонецПроцедуры

&НаСервере
Процедура ОчиститьТЧ()
	Объект.ПараметрыИзмерителя.Очистить();	
КонецПроцедуры 

#КонецОбласти

#Область События_Заполнения 

&НаСервере
Процедура ЗаполнитьКолонкиТаблицыИзРегистра()
		
	РезультатЗапроса 	= РегистрыСведений.бестПараметрыИзмерителей.ВернутьПараметрыИзмерителя(Объект.Дата,Объект.ПриборУчета);
	Ошибка 				= Ложь;
	ЗаполненПУ			= ЗначениеЗаполнено(Объект.ПриборУчета);
	
	Если РезультатЗапроса.Пустой() Тогда
		Если ЗаполненПУ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По данному прибору учета не указаны виды параметров");
		КонецЕсли;
		ОчиститьТЧ();
		Ошибка = Истина; 		
	КонецЕсли; 	
	
	ОписаниеЧисла 		= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3));   
	
	Выборка 					= РезультатЗапроса.Выбрать();
	МодульДок					= Документы.бестСуточнаяВедомость;
	СтатическиеКолонки 			= МодульДок.ПолучитьСтатическиеКолонки();
	СтатическиеКолонкиМассив 	= МодульДок.ПолучитьМассивСтатическихКолонок(); //Заполнены в необходимом порядке колонок
		
	ТаблицаРезультат = новый ТаблицаЗначений;
	Для Каждого ТекСтрЗначение из СтатическиеКолонкиМассив Цикл 		
		ТаблицаРезультат.Колонки.Добавить(ТекСтрЗначение.Имя, ТекСтрЗначение.Тип, ТекСтрЗначение.Заголовок);
	КонецЦикла;

	Пока Выборка.Следующий() Цикл
		ИмяКолонки 	= МодульДок.СформироватьИмяКолонки(Выборка.ВидПараметра); 		
		 
		ТаблицаРезультат.Колонки.Добавить(ИмяКолонки,ОписаниеЧисла,Выборка.ВидПараметра);
	КонецЦикла;	
	
	Таблица 			= РеквизитФормыВЗначение("ПараметрыИзмерителя");
	МассивРеквизитов 	= Новый Массив;	
		
	Для Каждого Колонка Из Таблица.Колонки Цикл
		МассивРеквизитов.Добавить("ПараметрыИзмерителя." + Колонка.Имя);       
	КонецЦикла;	
	
	ИзменитьРеквизиты(,МассивРеквизитов); 	
	
	ЭлементТаблица = Элементы.Найти("ПараметрыИзмерителя");
	Если ЭлементТаблица <> Неопределено Тогда
		Элементы.Удалить(ЭлементТаблица);       
	КонецЕсли;    
	
	ЭлементТаблица				= Элементы.Добавить("ПараметрыИзмерителя", Тип("ТаблицаФормы"),Элементы.ДинамическаяТаблица);
	ЭлементТаблица.ПутьКДанным 	= "ПараметрыИзмерителя";
	ЭлементТаблица.Отображение 	= ОтображениеТаблицы.Список;  
	                                                         	
	
	МассивРеквизитов.Очистить();		
	Для Каждого Колонка ИЗ ТаблицаРезультат.Колонки Цикл
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Колонка.ТипЗначения);
		НоваяКолонка = Новый РеквизитФормы(Колонка.Имя,
		Колонка.ТипЗначения, "ПараметрыИзмерителя",Колонка.Заголовок);
		МассивРеквизитов.Добавить(НоваяКолонка);
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов); 
	ЗначениеВРеквизитФормы(ТаблицаРезультат, "ПараметрыИзмерителя");	
	
	ЭлементТЗ = Элементы.ПараметрыИзмерителя; 	
	Для Каждого Колонка ИЗ ТаблицаРезультат.Колонки Цикл
		НовыйЭлементФормы = Элементы.Добавить("ПараметрыИзмерителя" + Колонка.Имя,
		Тип("ПолеФормы"), ЭлементТЗ);
		НовыйЭлементФормы.Вид 			= ВидПоляФормы.ПолеВвода;
		НовыйЭлементФормы.ПутьКДанным 	= "ПараметрыИзмерителя." + Колонка.Имя;
		
		СтатКолонка = СтатическиеКолонки.Получить(Колонка.Имя);
		Если не СтатКолонка = Неопределено Тогда
			НовыйЭлементФормы.Видимость = СтатКолонка.ВыводитьВТЧ;
		КонецЕсли;
		
	КонецЦикла;
	
	ЭлементТЗ.УстановитьДействие("ПриНачалеРедактирования", "ПараметрыИзмерителяПриНачалеРедактирования");
		
	Если не ЗаполненПУ или Ошибка Тогда
		ЭлементТЗ.видимость = Ложь;
	КонецЕсли; 
	
	УстановитьУсловноеОформление(ЭлементТЗ);
	
	Если Объект.ПараметрыИзмерителя.Количество() > 0 Тогда
		ЗаполнитьТаблицуДаннымиТЧ();
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДаннымиТЧ()
	ПараметрыИзмерителя.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСуточнаяВедомостьПараметрыИзмерителя.ВидПараметра КАК ВидПараметра,
		|	бестСуточнаяВедомостьПараметрыИзмерителя.IDСтроки КАК IDСтроки,
		|	бестСуточнаяВедомостьПараметрыИзмерителя.BНP КАК BНP,
		|	бестСуточнаяВедомостьПараметрыИзмерителя.BOC КАК BOC,
		|	бестСуточнаяВедомостьПараметрыИзмерителя.Значение КАК Значение,
		|	бестСуточнаяВедомостьПараметрыИзмерителя.ДатаВремя КАК ДатаВремя
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	&ТаблицаДанных КАК бестСуточнаяВедомостьПараметрыИзмерителя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.ВидПараметра КАК ВидПараметра,
		|	ВТ_Данные.IDСтроки КАК IDСтроки,
		|	ВТ_Данные.Значение КАК Значение,
		|	ВТ_Данные.ДатаВремя КАК ДатаВремя,
		|	ВТ_Данные.BНP КАК BНP,
		|	ВТ_Данные.BOC КАК BOC
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|ИТОГИ
		|	МАКСИМУМ(ДатаВремя),
		|	МАКСИМУМ(BНP),
		|	МАКСИМУМ(BOC)
		|ПО
		|	IDСтроки";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", Объект.ПараметрыИзмерителя.Выгрузить());
	
	РезультатЗапроса 	= Запрос.Выполнить();
	
	ВыборкаIDСтроки	= РезультатЗапроса.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	МодульДок		= Документы.бестСуточнаяВедомость;     
	
	Пока ВыборкаIDСтроки.Следующий() Цикл
		НоваяСтрока  = ПараметрыИзмерителя.Добавить();
		
		НоваяСтрока.IDСтроки 	= ВыборкаIDСтроки.IDСтроки;
		НоваяСтрока.ДатаВремя 	= ВыборкаIDСтроки.ДатаВремя;
		НоваяСтрока.BНP 		= ВыборкаIDСтроки.BНP;
		НоваяСтрока.BOC 		= ВыборкаIDСтроки.BOC;
		
		Выборка = ВыборкаIDСтроки.Выбрать();
		Пока Выборка.Следующий() Цикл
			ИмяКолонки 				= МодульДок.СформироватьИмяКолонки(Выборка.ВидПараметра);			
			НоваяСтрока[ИмяКолонки] = Выборка.Значение;
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область События_Выбора 

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	Объект.ПриборУчета = ПредопределенноеЗначение("Справочник.энргПриборыУчетаАбонента.ПустаяСсылка");
	ОчиститьТЧ();
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры


&НаКлиенте
Процедура ПриборУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ПараметрыФормы 			= Новый Структура("Отбор", Новый Структура("Ссылка", бестРаботаСприборамиУчетаСервер.ПолучитьМассивДействующихПриборовУчета(Объект.Дата,Объект.Организация,Объект.Район,Объект.ОбъектРасчета)));
	ОткрытьФорму("Справочник.энргПриборыУчетаАбонента.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область События_Обработки 

&НаКлиенте
Процедура ПараметрыИзмерителяПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		Элемент.ТекущиеДанные.IDСтроки = Строка(Новый УникальныйИдентификатор());
	иначе
		Если не ЗначениеЗаполнено(Элемент.ТекущиеДанные.IDСтроки) Тогда
			Элемент.ТекущиеДанные.IDСтроки = Строка(Новый УникальныйИдентификатор());
		КонецЕсли;   		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СтандартныеПодсистемы_ПодключаемыеКоманды
 
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьАдрессОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "Строение");
	КонецЕсли;
КонецПроцедуры
